micropython/micropython/ports/mimxrt/machine_encoder.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2020-2021 Damien P. George
 * Copyright (c) 2021 Robert Hammelrath
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#if MICROPY_PY_MACHINE_QECNT

#include "py/runtime.h"
#include "py/mphal.h"
#include "py/objint.h"
#include "shared/runtime/mpirq.h"
#include "extmod/modmachine.h"
#include "modmachine.h"
#include "fsl_clock.h"
#include "fsl_enc.h"
#include "fsl_xbara.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"

typedef struct _machine_encoder_obj_t {
    mp_obj_base_t base;
    ENC_Type *instance;
    int8_t id;
    bool active;
    uint8_t input_a;
    uint8_t input_b;
    uint8_t mode;
    bool is_signed;
    uint8_t match_pin;
    uint8_t phases_inv;
    uint32_t max_count;
    uint32_t min_count;
    uint32_t filter;
    uint16_t status;
    uint16_t requested_irq;
    mp_irq_obj_t *irq;
    enc_config_t enc_config;
} machine_encoder_obj_t;

typedef struct _encoder_xbar_signal_t {
    xbar_output_signal_t enc_input_a;
    xbar_output_signal_t enc_input_b;
    xbar_output_signal_t enc_index;
    xbar_output_signal_t enc_home;
    xbar_output_signal_t enc_trigger;
    xbar_input_signal_t enc_match;
} encoder_xbar_signal_t;

#define ENCODER_TRIGGER_MATCH      (kENC_PositionCompareFlag)
#define ENCODER_TRIGGER_ROLL_OVER  (kENC_PositionRollOverFlag)
#define ENCODER_TRIGGER_ROLL_UNDER (kENC_PositionRollUnderFlag)
#define ENCODER_ALL_INTERRUPTS     (0x7f)

#define XBAR_IN                    (1)
#define XBAR_OUT                   (0)

#define COUNTER_UP                 (-2)
#define COUNTER_DOWN               (-3)
#define MODE_ENCODER               (0)
#define MODE_COUNTER               (1)

static void encoder_deinit_single(machine_encoder_obj_t *self);

#if defined MIMXRT117x_SERIES

#define XBAR_ENC_DIR_OFFSET_1      (4)
#define XBAR_ENC_DIR_REGISTER_1    GPR20
#define XBAR_ENC_DIR_OFFSET_2      (32)
#define XBAR_ENC_DIR_REGISTER_2    GPR21
#define XBAR_OUT_MIN               (4)
#define XBAR_OUT_MAX               (42)
#define XBAR_STRING                "XBAR1_INOUT"
#define XBAR_STRING_LEN            strlen(XBAR_STRING)

static encoder_xbar_signal_t xbar_signal_table[FSL_FEATURE_SOC_ENC_COUNT] = {
    { kXBARA1_OutputDec1Phasea,
      kXBARA1_OutputDec1Phaseb,
      kXBARA1_OutputDec1Index,
      kXBARA1_OutputDec1Home,
      kXBARA1_OutputDec1Trigger,
      kXBARA1_InputDec1PosMatch },

    { kXBARA1_OutputDec2Phasea,
      kXBARA1_OutputDec2Phaseb,
      kXBARA1_OutputDec2Index,
      kXBARA1_OutputDec2Home,
      kXBARA1_OutputDec2Trigger,
      kXBARA1_InputDec2PosMatch },

    { kXBARA1_OutputDec3Phasea,
      kXBARA1_OutputDec3Phaseb,
      kXBARA1_OutputDec3Index,
      kXBARA1_OutputDec3Home,
      kXBARA1_OutputDec3Trigger,
      kXBARA1_InputDec3PosMatch },

    { kXBARA1_OutputDec4Phasea,
      kXBARA1_OutputDec4Phaseb,
      kXBARA1_OutputDec4Index,
      kXBARA1_OutputDec4Home,
      kXBARA1_OutputDec4Trigger,
      kXBARA1_InputDec4PosMatch },
};

#else // defined MIMXRT117x_SERIES

#if !defined(XBAR_ENC_DIR_OFFSET)
#define XBAR_ENC_DIR_OFFSET        (12)
#define XBAR_ENC_DIR_REGISTER      GPR6
#define XBAR_OUT_MIN               (4)
#define XBAR_OUT_MAX               (19)
#endif
#define XBAR_STRING                "XBAR_INOUT"
#define XBAR_STRING_LEN            strlen(XBAR_STRING)

static encoder_xbar_signal_t xbar_signal_table[FSL_FEATURE_SOC_ENC_COUNT] = {
    { kXBARA1_OutputEnc1PhaseAInput,
      kXBARA1_OutputEnc1PhaseBInput,
      kXBARA1_OutputEnc1Index,
      kXBARA1_OutputEnc1Home,
      kXBARA1_OutputEnc1Trigger,
      kXBARA1_InputEnc1PosMatch },

    #if FSL_FEATURE_SOC_ENC_COUNT > 1

    { kXBARA1_OutputEnc2PhaseAInput,
      kXBARA1_OutputEnc2PhaseBInput,
      kXBARA1_OutputEnc2Index,
      kXBARA1_OutputEnc2Home,
      kXBARA1_OutputEnc2Trigger,
      kXBARA1_InputEnc2PosMatch },

    #if FSL_FEATURE_SOC_ENC_COUNT > 2

    { kXBARA1_OutputEnc3PhaseAInput,
      kXBARA1_OutputEnc3PhaseBInput,
      kXBARA1_OutputEnc3Index,
      kXBARA1_OutputEnc3Home,
      kXBARA1_OutputEnc3Trigger,
      kXBARA1_InputEnc3PosMatch },

    { kXBARA1_OutputEnc4PhaseAInput,
      kXBARA1_OutputEnc4PhaseBInput,
      kXBARA1_OutputEnc4Index,
      kXBARA1_OutputEnc4Home,
      kXBARA1_OutputEnc4Trigger,
      kXBARA1_InputEnc4PosMatch },

    #endif
    #endif
};
#endif // defined MIMXRT117x_SERIES

static machine_encoder_obj_t *encoder_table[FSL_FEATURE_SOC_ENC_COUNT];
static ENC_Type *enc_instances[] = ENC_BASE_PTRS;
static IRQn_Type enc_irqn[] = ENC_COMPARE_IRQS;

__attribute__((section(".ram_functions"))) void irq_callback(int irq_num) {
    machine_encoder_obj_t *self = encoder_table[irq_num];
    if (self != NULL) {
        self->status = ENC_GetStatusFlags(self->instance);
        // In case of a position match event, disable that interrupt such that is is only handled
        // once until enabled again. This is needed since otherwise the match interrupt will
        // be triggered again as long as the match condition is true.
        if (self->status & kENC_PositionCompareFlag) {
            ENC_DisableInterrupts(self->instance, kENC_PositionCompareInerruptEnable);
        }
        ENC_ClearStatusFlags(self->instance, self->status);
        __DSB();
        mp_irq_handler(self->irq);
    }
}

__attribute__((section(".ram_functions"))) void ENC1_IRQHandler(void) {
    irq_callback(0);
}

